app/controllers/admin/homes_controller.rb

  def top
    @reservation = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def update
    @admin = current_admin

    if @admin.update(admin_params)
---
UPDATE "admins" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "やまだ"], ["profile_image_id", nil], ["introduction", "よろしく"], ["updated_at", "2021-10-14 22:50:48.056737"], ["id", 2]]