app/controllers/public/calendars_controller.rb

INSERT INTO "reservations" ("customer_id", "reservation_date", "time", "created_at", "updated_at", "admin_id") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["reservation_date", "2021-10-17 00:00:00"], ["time", "1"], ["created_at", "2021-10-14 08:24:54.320460"], ["updated_at", "2021-10-14 08:24:54.320460"], ["admin_id", 1]]
---
  def create
    @reservation = current_customer.reservations
 #   binding.pry
    @reservation = Reservation.new(reservation_time_params)
#    binding.pry
    @reservation.save

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def edit
    @reservation = Reservation.find(params[:id])

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reservations" SET "time" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["time", "12"], ["updated_at", "2021-10-09 05:35:07.303071"], ["id", 17]]
---
  def update
    @reservation = Reservation.find(params[:id])
    @reservation.update(reservation_time_params)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 16]]
---
  def destroy

		@reservation = Reservation.find(params[:id])
		@reservation.destroy