app/controllers/public/customers_controller.rb

UPDATE "customers" SET "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["last_name", "本田"], ["first_name", "健太郎"], ["last_name_kana", "ホンダ"], ["first_name_kana", "ケンタトウ"], ["telephone_number", "09000001111"], ["updated_at", "2021-10-09 08:43:24.981343"], ["id", 1]]
---
  def update
    @customer = current_customer

    if @customer.update(customer_params)