app/controllers/public/homes_controller.rb

  def top
    @customer = Customer.all
---
SELECT "customers".* FROM "customers"

  def index
    @admin = Admin.all
---
SELECT "admins".* FROM "admins"

  def show
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]