app/controllers/public/reservations_controller.rb

INSERT INTO "reservations" ("customer_id", "time", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 1], ["time", "1"], ["created_at", "2021-10-04 13:42:45.903606"], ["updated_at", "2021-10-04 13:42:45.903606"]]
---
  def create
    @reservation = current_customer.reservations
    @reservation = Reservation.new(reservation_time_params)
    @reservation.save