app/views/chats/show.html.erb

            <tr>
                <td><%= chat.customer.last_name %><%= chat.customer.first_name %></td>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

            <tr>
                <td><%= chat.customer.last_name %><%= chat.customer.first_name %></td>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]