app/controllers/chats_controller.rb

    def show
      if customer_signed_in?
        # どのユーザーとチャットするかを取得。
        @customer = Customer.find(params[:id])
        # カレントユーザーのuser_roomにあるroom_idの値の配列をroomsに代入。
        rooms = current_customer.user_rooms.pluck(:room_id)
        # user_roomモデルから
        # user_idがチャット相手のidが一致するものと、
        # room_idが上記roomsのどれかに一致するレコードを
        # user_roomsに代入。
        user_rooms = UserRoom.find_by(customer_id: @customer.id, room_id: rooms)
        # もしuser_roomが空でないなら
        unless user_rooms.nil?
        # @roomに上記user_roomのroomを代入
        @room = user_rooms.room
        else
          # それ以外は新しくroomを作り、
          @room = Room.new
          @room.save
          # user_roomをカレントユーザー分とチャット相手分を作る
          UserRoom.create(customer_id: current_customer.id, room_id: @room.id)
          UserRoom.create(customer_id: @customer.id, room_id: @room.id)
        end
        @chats = @room.chats
        @chat = Chat.new(room_id: @room.id)

      else
        @customer = Customer.find(params[:id])
       # binding.pry
        rooms = current_admin.id
        user_rooms = UserRoom.find_by(customer_id: @customer.id, room_id: rooms)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "user_rooms"."room_id" FROM "user_rooms" WHERE "user_rooms"."customer_id" = ?  [["customer_id", 1]]
SELECT  "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."customer_id" = ? AND "user_rooms"."room_id" = ? LIMIT ?  [["customer_id", 1], ["room_id", 1], ["LIMIT", 1]]
INSERT INTO "user_rooms" ("room_id", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?)  [["room_id", 2], ["created_at", "2021-10-07 10:49:32.386707"], ["updated_at", "2021-10-07 10:49:32.386707"], ["customer_id", 1]]
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-10-07 10:48:34.380050"], ["updated_at", "2021-10-07 10:48:34.380050"]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

        @room = user_rooms.room
        else
          @room = Room.new
          @room.save
---
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-10-16 11:47:21.287245"], ["updated_at", "2021-10-16 11:47:21.287245"]]

    def create
      if customer_signed_in?
        @chat = current_customer.chats.new(chat_params)
#        binding.pry
        @chat.save
        redirect_to request.referer
      else
        @chat = current_admin.chats.new(chat_params)
#        binding.pry
        @chat.save
---
INSERT INTO "chats" ("admin_id", "room_id", "message", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["admin_id", 1], ["room_id", 1], ["message", "tesuto"], ["created_at", "2021-10-17 00:54:00.119560"], ["updated_at", "2021-10-17 00:54:00.119560"], ["customer_id", 1]]
INSERT INTO "chats" ("admin_id", "room_id", "message", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["admin_id", 1], ["room_id", 1], ["message", "てすとっっs"], ["created_at", "2021-10-17 01:55:23.256057"], ["updated_at", "2021-10-17 01:55:23.256057"], ["customer_id", 1]]