app/controllers/chats_controller.rb

INSERT INTO "chats" ("admin_id", "room_id", "message", "created_at", "updated_at", "customer_id") VALUES (?, ?, ?, ?, ?, ?)  [["admin_id", 2], ["room_id", 1], ["message", "テスト隠しパラ目追加3"], ["created_at", "2021-10-16 05:17:34.830773"], ["updated_at", "2021-10-16 05:17:34.830773"], ["customer_id", 2]]
---
    def create
      @chat = current_customer.chats.new(chat_params)
      @chat.save